Pandas, tool for data manipulation in python.

Python package for data analysis and data manipulation.


Types

Pandas series

Pandas dataframe

Pandas Series

In [1]:
import pandas as pd
import numpy as np

c:\Users\hbukirwa\AppData\Local\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:61: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
index = ['index_one','index_two','index_three']
my_list = [1,2,3]

In [3]:
my_series = pd.Series(my_list,index) # One-dimensional ndarray with axis labels
my_series

index_one      1
index_two      2
index_three    3
dtype: int64

In [4]:
my_series[0]

C:\Users\hbukirwa\AppData\Local\Temp\ipykernel_27408\1791900707.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  my_series[0]

1

In [5]:
my_series.index

Index(['index_one', 'index_two', 'index_three'], dtype='object')

In [6]:
my_series['index_two']

2

In [7]:
type(my_series)

pandas.core.series.Series

In [8]:
my_series.max()

3

In [9]:
my_series.min()

1

In [10]:
series2 = pd.Series([1,2,5,4],index = ['index_one', 'index_two', 'index_three','index_four'])
series2

index_one      1
index_two      2
index_three    5
index_four     4
dtype: int64

In [11]:
my_series + series2

index_four     NaN
index_one      2.0
index_three    8.0
index_two      4.0
dtype: float64

In [12]:
my_series / series2

index_four     NaN
index_one      1.0
index_three    0.6
index_two      1.0
dtype: float64

In [13]:
my_series % series2

index_four     NaN
index_one      0.0
index_three    3.0
index_two      0.0
dtype: float64

In [14]:
my_series * series2

index_four      NaN
index_one       1.0
index_three    15.0
index_two       4.0
dtype: float64

Pandas Dataframe

Its a tabular data structure (with rows and columns)

In [15]:
names_dict = {
    'Name' : ['Ken','Jeff','John','Mike','Andrew','Ann','Sylvia','Dorothy','Emily','Loyford'],
    'Age' : [31,52,56,12,45,np.nan,78,85,46,135],
    'Phone' : [52,79,80,75,43,125,74,44,85,45],
    'Uni' : ['One','Two','Three','One','Two','Three','One','Two','Three','One']

}

In [16]:
df = pd.DataFrame(names_dict)
df

      Name    Age  Phone    Uni
0      Ken   31.0     52    One
1     Jeff   52.0     79    Two
2     John   56.0     80  Three
3     Mike   12.0     75    One
4   Andrew   45.0     43    Two
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

In [17]:
df.head()  # First 5 records

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [18]:
df.tail()  # Last 5 records

      Name    Age  Phone    Uni
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

In [19]:
df.describe()  #Summary of the dataset

              Age       Phone
count    9.000000   10.000000
mean    60.000000   70.200000
std     35.742132   25.441873
min     12.000000   43.000000
25%     45.000000   46.750000
50%     52.000000   74.500000
75%     78.000000   79.750000
max    135.000000  125.000000

In [20]:
df.reset_index()  # Reset the index to the default. The old index is added as a column and a new sequential index is used

   index     Name    Age  Phone    Uni
0      0      Ken   31.0     52    One
1      1     Jeff   52.0     79    Two
2      2     John   56.0     80  Three
3      3     Mike   12.0     75    One
4      4   Andrew   45.0     43    Two
5      5      Ann    NaN    125  Three
6      6   Sylvia   78.0     74    One
7      7  Dorothy   85.0     44    Two
8      8    Emily   46.0     85  Three
9      9  Loyford  135.0     45    One

In [21]:
df.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [22]:
df.reset_index(inplace=True)
df

   index     Name    Age  Phone    Uni
0      0      Ken   31.0     52    One
1      1     Jeff   52.0     79    Two
2      2     John   56.0     80  Three
3      3     Mike   12.0     75    One
4      4   Andrew   45.0     43    Two
5      5      Ann    NaN    125  Three
6      6   Sylvia   78.0     74    One
7      7  Dorothy   85.0     44    Two
8      8    Emily   46.0     85  Three
9      9  Loyford  135.0     45    One

In [23]:
df.drop('index',axis=1) # Axis 1 is columns and axis 0 is rows

      Name    Age  Phone    Uni
0      Ken   31.0     52    One
1     Jeff   52.0     79    Two
2     John   56.0     80  Three
3     Mike   12.0     75    One
4   Andrew   45.0     43    Two
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

In [24]:
df

   index     Name    Age  Phone    Uni
0      0      Ken   31.0     52    One
1      1     Jeff   52.0     79    Two
2      2     John   56.0     80  Three
3      3     Mike   12.0     75    One
4      4   Andrew   45.0     43    Two
5      5      Ann    NaN    125  Three
6      6   Sylvia   78.0     74    One
7      7  Dorothy   85.0     44    Two
8      8    Emily   46.0     85  Three
9      9  Loyford  135.0     45    One

In [25]:
df.drop('index',axis=1, inplace=True)
df

      Name    Age  Phone    Uni
0      Ken   31.0     52    One
1     Jeff   52.0     79    Two
2     John   56.0     80  Three
3     Mike   12.0     75    One
4   Andrew   45.0     43    Two
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

Checking for null values

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     9 non-null      float64
 2   Phone   10 non-null     int64
 3   Uni     10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

In [27]:
df.isnull().any()

Name     False
Age       True
Phone    False
Uni      False
dtype: bool

In [28]:
df.tail()

      Name    Age  Phone    Uni
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

Replacing the null value with a median

In [29]:
df.describe()

              Age       Phone
count    9.000000   10.000000
mean    60.000000   70.200000
std     35.742132   25.441873
min     12.000000   43.000000
25%     45.000000   46.750000
50%     52.000000   74.500000
75%     78.000000   79.750000
max    135.000000  125.000000

In [30]:
df['Age'].fillna(52)

0     31.0
1     52.0
2     56.0
3     12.0
4     45.0
5     52.0
6     78.0
7     85.0
8     46.0
9    135.0
Name: Age, dtype: float64

In [31]:
df

      Name    Age  Phone    Uni
0      Ken   31.0     52    One
1     Jeff   52.0     79    Two
2     John   56.0     80  Three
3     Mike   12.0     75    One
4   Andrew   45.0     43    Two
5      Ann    NaN    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

In [32]:
df['Age'].fillna(52, inplace=True)
df

C:\Users\hbukirwa\AppData\Local\Temp\ipykernel_27408\1399522821.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(52, inplace=True)

      Name    Age  Phone    Uni
0      Ken   31.0     52    One
1     Jeff   52.0     79    Two
2     John   56.0     80  Three
3     Mike   12.0     75    One
4   Andrew   45.0     43    Two
5      Ann   52.0    125  Three
6   Sylvia   78.0     74    One
7  Dorothy   85.0     44    Two
8    Emily   46.0     85  Three
9  Loyford  135.0     45    One

Creating new columns

In [33]:
df.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [34]:
df['times'] = df['Age'] * df['Phone']

In [35]:
df.columns

Index(['Name', 'Age', 'Phone', 'Uni', 'times'], dtype='object')

In [36]:
#df.drop('level_0', inplace=True)
df

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
3     Mike   12.0     75    One   900.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   52.0    125  Three  6500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

Selecting items from a dataframe

In [37]:
df.head()

     Name   Age  Phone    Uni   times
0     Ken  31.0     52    One  1612.0
1    Jeff  52.0     79    Two  4108.0
2    John  56.0     80  Three  4480.0
3    Mike  12.0     75    One   900.0
4  Andrew  45.0     43    Two  1935.0

In [38]:
# Using the index location

df.iloc[0]  # selecting the first row

Name        Ken
Age        31.0
Phone        52
Uni         One
times    1612.0
Name: 0, dtype: object

In [39]:
type(df.iloc[0])

pandas.core.series.Series

In [40]:
#Using the names to select

df['Name']  # It gives us a series

0        Ken
1       Jeff
2       John
3       Mike
4     Andrew
5        Ann
6     Sylvia
7    Dorothy
8      Emily
9    Loyford
Name: Name, dtype: object

In [41]:
type(df['Name'])

pandas.core.series.Series

In [42]:
# As a dataframe, pass the name as a list

df[['Name']]

      Name
0      Ken
1     Jeff
2     John
3     Mike
4   Andrew
5      Ann
6   Sylvia
7  Dorothy
8    Emily
9  Loyford

In [43]:
type(df[['Name']])

pandas.core.frame.DataFrame

In [44]:
#Selecting multiple columns. Pass the column names as a list

df[['Name','Age']]

      Name    Age
0      Ken   31.0
1     Jeff   52.0
2     John   56.0
3     Mike   12.0
4   Andrew   45.0
5      Ann   52.0
6   Sylvia   78.0
7  Dorothy   85.0
8    Emily   46.0
9  Loyford  135.0

In [45]:
df['Age'] > 20

0     True
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: Age, dtype: bool

In [46]:
df[df['Age'] > 20]

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   52.0    125  Three  6500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

In [47]:
df[df['Name']=='Ken']

  Name   Age  Phone  Uni   times
0  Ken  31.0     52  One  1612.0

In [48]:
df[(df['Age'] > 20) & (df['Phone'] > 40)]

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   52.0    125  Three  6500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

In [49]:
df[(df['Age'] > 20) | (df['Phone'] > 40)]

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
3     Mike   12.0     75    One   900.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   52.0    125  Three  6500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

Grouping Data in Pandas

In [50]:
df.groupby(['Uni'])

In [51]:
df.groupby(['Uni'])['Age'].mean()

Uni
One      64.000000
Three    51.333333
Two      60.666667
Name: Age, dtype: float64

In [52]:
df.groupby('Uni')['Age'].mean().sort_values(ascending=False)

Uni
One      64.000000
Two      60.666667
Three    51.333333
Name: Age, dtype: float64

In [53]:
group = df.groupby('Uni')['Age'].mean().sort_values(ascending = False).reset_index()
group

     Uni        Age
0    One  64.000000
1    Two  60.666667
2  Three  51.333333

In [54]:
group.columns = ['University','Mean Age']  # Changing column names
group

  University   Mean Age
0        One  64.000000
1        Two  60.666667
2      Three  51.333333

In [55]:
df['Uni'].unique() #Get unique values

array(['One', 'Two', 'Three'], dtype=object)

In [56]:
df['Uni'].nunique() #Get number of unique values

3

In [57]:
df['Uni'].count() #Count number of values

10

Exporting a Pandas Dataframe

In [60]:
import os

folder = r"C:\Users\hbukirwa\OneDrive - DFCU Bank Uganda\Desktop\Python BootCamp"
os.makedirs(folder, exist_ok=True)

In [62]:
df.to_csv(os.path.join(folder, "names_with_index.csv"), index=False)#index=True by default
df.to_excel(os.path.join(folder,'names.xlsx'), index=False)
df.to_json(os.path.join(folder,'data.json'))

In [66]:
df_csv = pd.read_csv('names_with_index.csv')
df_csv

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
3     Mike   12.0     75    One   900.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   52.0    125  Three  6500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

Creating Pivot Tables

Using pivot_table(df, values, columns) function

In [67]:
pd.pivot_table(df_csv, values='Phone', columns=['Name'])

Name   Andrew    Ann  Dorothy  Emily  Jeff  John   Ken  Loyford  Mike  Sylvia
Phone    43.0  125.0     44.0   85.0  79.0  80.0  52.0     45.0  75.0    74.0

In [68]:
pd.pivot_table(df_csv, values='Age', columns=['Uni'],aggfunc='mean')

Uni   One      Three        Two
Age  64.0  51.333333  60.666667

In [69]:
pd.pivot_table(df_csv, values='Name', columns=['Uni'],aggfunc='count')

Uni   One  Three  Two
Name    4      3    3